{
  "name": "Eetu Karttunen",
  "title": "Full Stack Developer",
  "github": "https://github.com/eetukarttunen",
  "email": "mailto:eetu.karttunen@outlook.com",
  "linkedin": "https://www.linkedin.com/in/eetukarttunen",
  "projectsText": "Projects",
  "aboutText": "About",
  "contactText": "Contact",
  "demosText": "Demos",
  "projectsButton": "Projects",
  "aboutButton": "About",
  "contactButton": "Contact",
  "demosButton": "Demos",
  "aboutParagraph": "Here will be text in english",
  "projectsParagraph": "On this page, I showcase some of my most recent leisure projects, which I have independently developed to everyday tasks easier. Additionally, there are projects I've been invited to contribute to as a developer. If you are interested in hearing about my previous professional projects, feel free to reach out to me via LinkedIn.",
  "demosParagraph": "As you may notice, there is currently an ongoing construction on this page. If you are interested in seeing some examples of my work, I recommend visiting the 'Projects' page, where you can find some tangible examples.",
  "opiskelijaruokalistatHeading": "Student restaurant menus - web application",
  "opiskelijaruokalistatDetails": "Daily userbase: ~ 20 users.",
  "opiskelijaruokalistatDescription": "In this project, I integrated the lists of all student restaurant in the Joensuu area into a single view to facilitate the selection of preferred student meals on weekdays. A common view for all student cafeterias was not available, so I decided to take action and implement this for the use of this group of friends and myself. The web application includes a separate frontend and backend. The backend retrieves the data for each cafeteria using the Fazer & CO. (Compass Group) API. The frontend is mainly responsible for presenting the data. The web application is designed primarily for mobile use but also functions well on other devices through a web browser.",
  "atkytpHeading": "ATK-YTP Event Website",
  "atkytpDetails": "User count during the event ~ 350 users",
  "atkytpDescription": "In this project, I worked as a member of a three-person development team, designing and developing the website for the Automatic Data Processing Cooperation Days (ATK-YTP). The main purpose of the website was to assist event participants in finding information about the event, schedules, and Joensuu as the event city. The website also included a Leaflet-based map that relied on coordinates to display the locations of event activities."
}